{
  "name": "Lucy Mitchell",
  "contact": {
    "phone": "07483824878",
    "email": "lucymitchell574@gmail.com",
    "linkedin": "https://www.linkedin.com/in/lucy-mitchell-a39214234"
  },
  "summary": "Hello! I'm a software engineer with 4 years of experience, recently finished a first-class degree in Software Engineering from the University of Glasgow. I’ve been working at Barclays through a graduate apprenticeship, mainly focused on backend development with Java building APIs, integrating SQL databases into applications, and keeping systems clean, scalable, and reliable. I’m also comfortable across the stack with tools like Angular and TypeScript, and I work regularly with Jira, GitLab repos, and deployment pipelines. I enjoy working in Agile teams, solving real-world problems, and writing code that’s solid, practical, and maintainable.",
  "education": [
    {"qualification": "BSc (Hons) Software Engineering (First Class Honours)",
    "institution": "University of Glasgow",
    "location": "Glasgow, UK",
    "years": "2021 – 2025",
      "notes": [
        "Completed alongside full-time software engineering work as part of a graduate apprenticeship."
      ]  }],
  "experience": [
    {
      "title": "Software Engineer (Graduate Apprentice)",
      "company": "Barclays",
      "location": "Glasgow, UK",
      "years": "2021 – Present",
      "responsibilities": [
        "Designed and developed backend services using Java (incl. Spring Boot, Maven), supporting core internal tools across development teams.",
        "Built and maintained RESTful APIs and data integration layers with SQL and Java, optimizing performance and maintainability.",
        "Created frontends using Angular and TypeScript where required, ensuring cohesive full-stack functionality.",
        "Implemented comprehensive test coverage using JUnit and integrated testing into CI pipelines.",
        "Deployed containerized applications using Kubernetes within CI/CD workflows.",
        "Participated in Agile delivery cycles and mentored junior developers on team processes and engineering best practices."
      ]
    }
  ],
  "projects": [
    {
      "title": "Test Environment Dashboard [Workplace]",
      "details": [
        "Developed backend logic in Java and SQL to aggregate and expose test environment data via APIs.",
        "Built a simple frontend using Angular for visual representation, focusing on backend-first architecture.",
        "Integrated multiple third-party systems using both RESTful and SOAP APIs."
      ]
    },
    {
      "title": "Automated Test Double Tool [Workplace]",
      "details": [
        "Led development of a backend system to simulate responses from dependent services, reducing test complexity.",
        "Built API services in Java with REST endpoints; frontend was added using Angular and TypeScript.",
        "Integrated with automation frameworks for continuous testing use cases."
      ]
    },
    {
      "title": "More to come...watch this space!",
      "details": [
        ""
      ]
    }
  ],
  "skills": {
    "languages": ["Java", "SQL", "TypeScript", "HTML/CSS", "Avaloq Script", "JavaScript", "Bash", "JSON", "XML"],
    "backend": [
      "RESTful APIs",
      "SOAP",
      "Java services",
      "Spring Boot",
      "Maven",
      "Microservices Architecture",
      "Authentication & Authorization"
    ],
    "frontend": [
      "Angular",
      "TypeScript",
      "HTML",
      "Responsive Design",
      "Component-based architecture"
    ],
    "testing": [
      "JUnit",
      "Mockito",
      "Integration Testing",
      "Test Doubles",
      "TDD (Test-Driven Development)",
      "Postman (API testing)",
      "CI-integrated testing"
    ],
    "tools": [
      "Maven",
      "Git",
      "GitLab Repos",
      "Kubernetes",
      "Docker",
      "Grafana",
      "Jira",
      "Confluence",
      "CI/CD pipelines",
      "GitLab CI"
    ],
    "practices": [
      "Agile (Scrum)",
      "Clean Code",
      "Code Reviews",
      "Continuous Integration",
      "Continuous Deployment",
      "DevOps Collaboration",
      "Version Control (Git)",
      "Documentation"
    ],
    "softSkills": [
      "Team collaboration",
      "Communication",
      "Problem-solving",
      "Adaptability",
      "Time management",
      "Attention to detail",
      "Critical thinking"
    ]
  }
}
